# BoundingBoxUV Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundingBoxUV Constructor
BoundingBoxUV Class See Also
---
default constructor
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public BoundingBoxUV()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
BoundingBoxUV()
```

# See Also
BoundingBoxUV Class
BoundingBoxUV Overload
Autodesk.Revit.DB Namespace